CFD-Computational Heat Transfer/03_OpenFOAM/Backward_Facing_Step/Re_550/Case_Setup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type codedFixedValue;
        value uniform (0 0 0);
        redirectType parabolic;
        code
        #{
            const fvPatch& p = patch();
            const vectorField& Cf = p.Cf();
            scalar h = 0.01;
            scalar mu  = 1.81e-5;     // dynamic viscosity
	    scalar rho = 1.205;       // density
            scalar nu  = mu/rho;
	    scalar Dh = 0.02;
            scalar Re = 550; // Change for each case
            scalar Umean = Re*nu/Dh;  // bulk velocity
            scalar Umax = 1.5*Umean; // parabolic max

            vectorField& field = *this;

            forAll(field, i)
	    {
    		scalar y = Cf[i].y();    // between 0 and h
    		scalar yRel = y/h;       // normalize 0 → 1
    		field[i] = vector(4*Umax*yRel*(1-yRel), 0, 0);
	    }
        #};
    }

    outlet
    {
        type zeroGradient;
    }

    fixedWalls
    {
        type noSlip;
    }

    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
